Revit 2026 API

# ParameterCanBeAssociatedWithGlobalParameters Method

---

Tests whether this parameter can be associated with any global parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanBeAssociatedWithGlobalParameters()
```
```vb
Public Function CanBeAssociatedWithGlobalParameters As Boolean
```
```cpp
public:
bool CanBeAssociatedWithGlobalParameters()
```
```fsharp
member CanBeAssociatedWithGlobalParameters : unit -> bool
```

#### Return Value

Boolean True if the given parameter can be associated (is parametrizable); False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | This parameter does not exist in the document anymore. |

Only properties defined as parametrizable can be associated with global parameters. That excludes any read-only and formula-driven parameters, as well as those that have other explicit or implicit restrictions imposed by Revit.

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace